test/site/content-org/all-posts.org
#+hugo_base_dir: ../

#+seq_todo: TODO DRAFT DONE
#+seq_todo: TEST__TODO | TEST__DONE

#+property: header-args :eval never-export

#+startup: indent

#+macro: doc [[https://ox-hugo.scripter.co/doc/$1][$2]]
#+macro: oxhugoissue =ox-hugo= Issue #[[https://github.com/kaushalmodi/ox-hugo/issues/$1][$1]]
#+macro: hugoissue =hugo= Issue #[[https://github.com/gohugoio/hugo/issues/$1][$1]]
#+macro: hugopr =hugo= PR #[[https://github.com/gohugoio/hugo/pull/$1][$1]]
#+macro: bfissue /Blackfriday/ Issue #[[https://github.com/russross/blackfriday/issues/$1][$1]]
#+macro: commit commit [[https://github.com/kaushalmodi/ox-hugo/commit/$1][$1]]

# https://scripter.co/latex-in-html/
#+macro: latex @@html:<span class="latex">L<sup>a</sup>T<sub>e</sub>X</span>@@
#+macro: youtube @@html:<div class="org-youtube"><iframe src="https://www.youtube-nocookie.com/embed/$1" allowfullscreen title="YouTube Video"></iframe></div>@@

#+bibliography: cite/bib/orgcite.bib

#+author:

*** Whitespace trimming around special blocks (corner cases)   :corner_cases:
:PROPERTIES:
:EXPORT_FILE_NAME: ws-trimming-around-special-blocks-corner-cases
:EXPORT_HUGO_PAIRED_SHORTCODES: %inline
:END:
#+begin_description
Corner cases for testing the whitespace trimming around the special
blocks.
#+end_description
**** Whitespace trimming inside quote blocks
#+begin_quote
line 1
#+begin_mark
marked text
#+end_mark
line 2

line 4 (line 3, above, is blank, but inside the quote block)
#+end_quote

- Special block in a quote block in a list
  #+begin_quote
  line 1
  #+begin_mark
  marked text
  #+end_mark
  line 2

  line 4 (line 3, above, is blank, but inside the quote block)
  #+end_quote
**** Whitespace trimming before list elements
something
#+begin_mark
marked text
#+end_mark
- list item 1
- list item 2
**** Whitespace trimming before headings
something
#+begin_mark
marked text
#+end_mark
***** Next heading
**** Whitespace trimming before and after code blocks
something
#+begin_mark
marked text
#+end_mark
#+begin_example
code line
#+end_example
#+begin_mark
marked text
#+end_mark

something
~inline code 1~
#+begin_mark
marked text
#+end_mark
~inline code 2~
something
**** Whitespace trimming with ~:trim-pre~ set immediately after a heading
#+begin_mark
marked text
#+end_mark
**** ~>~ character before a special block with ~:trim_pre~ set
#+begin_export html
<style>
  .red {
    color: red;
  }
</style>
#+end_export
#+attr_html: :class red
#+begin_mark
This marked text's foreground is red.
#+end_mark
**** Hugo shortcode in a definition list with pre/post trimming
The content in the ~inline~ shortcode (created for this test site)
should render /inline/ and not create a parapraph break at the end of
it.
- defn1 ::
  Lorem ipsum dolor sit amet, consectetur adipiscing elit. Quisque et
  quam metus. Etiam in iaculis mi, sit amet pretium magna. Donec ut
  dui mi. Maecenas pharetra sapien nunc, ut mollis enim aliquam
  quis.
  #+header: :trim-pre t :trim-post t
  #+begin_inline
  Lorem ipsum dolor sit amet, consectetur adipiscing elit. Quisque et
  quam metus. Etiam in iaculis mi, sit amet pretium magna. Donec ut
  dui mi. Maecenas pharetra sapien nunc, ut mollis enim aliquam
  quis.
  #+end_inline
  Lorem ipsum dolor sit amet, consectetur adipiscing elit. Quisque et
  quam metus. Etiam in iaculis mi, sit amet pretium magna. Donec ut
  dui mi. Maecenas pharetra sapien nunc, ut mollis enim aliquam
  quis.
- defn2 ::
  Lorem ipsum dolor sit amet, consectetur adipiscing elit. Quisque et
  quam metus. Etiam in iaculis mi, sit amet pretium magna. Donec ut
  dui mi. Maecenas pharetra sapien nunc, ut mollis enim aliquam
  quis.
**** Last element of a post
#+begin_mark
No "post" trim markers should be inserted after this block as it's the
last element of this post.
#+end_mark
